src/CFD/OpenFOAM/OpenFOAM-v2206-MUI/modules/visualization/tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeater/system/heater/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  4;

method          scotch;

simpleCoeffs
{
    n           (2 2 1);
    delta       0.001;
}

hierarchicalCoeffs
{
    n           (2 2 1);
    delta       0.001;
    order       xyz;
}

scotchCoeffs
{
}

manualCoeffs
{
    dataFile    "decompositionData";
}

// ************************************************************************* //
